# Trabalhando com Planilhas do Excel

In [ ]:
#/content/drive/MyDrive/Colab-DIO/Databases/Aracaju.xlsx
import pandas as pd

In [ ]:
df1 = pd.read_excel("/content/drive/MyDrive/Colab-DIO/Databases/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/MyDrive/Colab-DIO/Databases/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/MyDrive/Colab-DIO/Databases/Natal.xlsx")
df4 = pd.read_excel("/content/drive/MyDrive/Colab-DIO/Databases/Recife.xlsx")
df5 = pd.read_excel("/content/drive/MyDrive/Colab-DIO/Databases/Salvador.xlsx")

In [ ]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [ ]:
df = pd.concat([df1,df2,df3,df4,df5])

In [ ]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
17   Salvador 2019-02-14  158.66    1037     1
82   Salvador 2019-01-01  207.88    1035     1
188  Salvador 2019-01-02  178.11    1035     3
30   Salvador 2019-01-01   47.96    1034     2
30      Natal 2018-10-02  856.00     853     4

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
df["LojaID"] = df["LojaID"].astype("object")

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [ ]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [ ]:
df["Vendas"].mean()

122.61180089485438

In [ ]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
118   Salvador 2019-03-02   92.21   1035     2
121     Recife 2019-03-02   41.55    981     3
26       Natal 2018-07-20  370.00    853     3
230      Natal 2019-01-03  184.69   1036     1
73      Recife 2019-01-01   39.71    981     5
131   Salvador 2019-03-02   63.48   1037     3
90     Aracaju 2018-01-01   16.27   1522     1
129     Recife 2019-03-02   35.34    982     7
18      Recife 2019-01-01   49.40    980     5
120    Aracaju 2018-01-01    7.73   1520    10
108    Aracaju 2018-01-01   31.94   1520     8
90       Natal 2019-01-02  100.54   1036     2
68     Aracaju 2018-01-01  179.74   1520     2
191      Natal 2019-01-02  173.59   1034     2
47   Fortaleza 2019-01-01   13.45   1004     5

In [ ]:
df["Vendas"].fillna(0, inplace=True)

df.dropna(inplace=True)

df.dropna(subset=["Vendas"], inplace=True)

df.dropna(how="all", inplace=True)

In [ ]:
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [ ]:
df["Receita"].max()

3544.0

In [ ]:
df["Receita"].min()

3.34

In [ ]:
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [ ]:
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [ ]:
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

# Trabalhando com datas

In [ ]:
df["Data"] = df["Data"].astype("int64")

In [ ]:
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [ ]:
df["Data"] = pd.to_datetime(df["Data"])

df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [ ]:
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [ ]:
df["Ano_Venda"] = df["Data"].dt.year
df.sample(5)

        Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
143      Natal 2019-01-02   41.18  ...    82.36             2.0       2019
29       Natal 2019-03-09  646.00  ...  1292.00             2.0       2019
121  Fortaleza 2019-03-02   41.55  ...   124.65             3.0       2019
207      Natal 2019-01-02   46.70  ...    93.40             2.0       2019
132     Recife 2019-03-02   17.49  ...    87.45             5.0       2019

[5 rows x 8 columns]

In [ ]:
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)
df.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
22   Salvador 2019-01-01   32.57  ...      2019          1          1
206     Natal 2019-01-02  151.45  ...      2019          1          2
108    Recife 2019-03-02  152.89  ...      2019          3          2
92    Aracaju 2018-01-01   37.46  ...      2018          1          1
126  Salvador 2019-03-02   41.69  ...      2019          3          2

[5 rows x 10 columns]

In [ ]:
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [ ]:
df["diferenca_dias"] = df["Data"] - df["Data"].min()
df.sample(5)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
151   Salvador 2019-01-02   14.63  ...         1          2        366 days
73     Aracaju 2018-01-01  159.78  ...         1          1          0 days
10     Aracaju 2019-01-01   42.34  ...         1          1        365 days
19     Aracaju 2018-01-01   43.96  ...         1          1          0 days
113  Fortaleza 2019-03-02   38.63  ...         3          2        425 days

[5 rows x 11 columns]

In [ ]:
df["trimestre_venda"] = df["Data"].dt.quarter
df.sample(5)

      Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
113  Aracaju 2018-01-01   23.05  ...         1          0 days                1
58   Aracaju 2018-01-01   37.14  ...         1          0 days                1
130    Natal 2019-01-02   59.78  ...         2        366 days                1
68     Natal 2018-06-22  274.00  ...        22        172 days                2
174    Natal 2019-01-02   35.30  ...         2        366 days                1

[5 rows x 12 columns]

In [ ]:
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
109   Salvador 2019-03-02  124.37  ...         2        425 days                1
2        Natal 2019-03-11  308.00  ...        11        434 days                1
110   Salvador 2019-03-02  185.93  ...         2        425 days                1
116  Fortaleza 2019-03-02   79.10  ...         2        425 days                1
74       Natal 2019-03-10  303.00  ...        10        433 days                1
131  Fortaleza 2019-03-02  139.07  ...         2        425 days                1
134     Recife 2019-03-02  195.18  ...         2        425 days                1
42       Natal 2019-03-02  775.00  ...         2        425 days                1
18       Natal 2019-03-14  581.00  ...        14        437 days                1
129   Salvador 2019-03-02  125.66  ...         2        425 days                1
126  Fortaleza 2019-03-02   41.87  ...         2        425 days                1
122  Fortaleza 2019-03-02  235.06  ...         2        425 days                1
118   Salvador 2019-03-02   92.21  ...         2        425 days                1
139   Salvador 2019-03-02  169.01  ...         2        425 days                1
117     Recife 2019-03-02   15.42  ...         2        425 days                1
117   Salvador 2019-03-02   39.41  ...         2        425 days                1
118  Fortaleza 2019-03-02   17.70  ...         2        425 days                1
119     Recife 2019-03-02  152.30  ...         2        425 days                1
134  Fortaleza 2019-03-02  195.18  ...         2        425 days                1
135  Fortaleza 2019-03-02   10.79  ...         2        425 days                1

[20 rows x 12 columns]